{
  "backend/main.mo": "Actor canister handling public inquiry submissions, admin retrieval of inquiries, and user profile management with access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented site features to related source files and components.",
  "frontend-file-summaries.txt": "Text file listing concise summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base layer with OKLCH color variables and light/dark theme configuration.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component assembling all marketing site sections with header and footer.",
  "frontend/src/components/layout/Section.tsx": "Reusable layout component providing consistent spacing and optional muted variant styling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with company info, quick links, services list, and contact details.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky responsive header with logo, navigation, and mobile menu.",
  "frontend/src/components/sections/AboutSection.tsx": "About section describing the company mission, vision, and service area.",
  "frontend/src/components/sections/ContactSection.tsx": "A contact form component with validation and submission via useSubmitInquiry, displaying contact info and handling form state and errors.",
  "frontend/src/components/sections/HomeHero.tsx": "Hero section with background image, marketing text, key points, and CTA buttons that scroll to other sections.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Displays a grid of project cards sourced from marketingContent, showing titles, types, locations, and descriptions.",
  "frontend/src/components/sections/ServicesSection.tsx": "Renders a services grid using icons and descriptions from marketingContent, mapping icon names to Lucide icons.",
  "frontend/src/components/sections/WhyChooseUsSection.tsx": "Shows differentiators from marketingContent in a grid with mapped icons and brief descriptions.",
  "frontend/src/content/marketingContent.ts": "Exports structured marketing data for services, differentiators, and projects used across UI sections.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and authentication handling, including login, logout, and identity restoration.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Defines a mutation hook that submits inquiries through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Defines Tailwind layers and custom OKLCH theme variables for light/dark modes and sets global typography and layout styles.",
  "frontend/src/lib/utils.ts": "Provides a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/src/utils/validation.ts": "Validates inquiry form fields for required values and format, returning error messages.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, shadows, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current features, requirements, assets, and pending feature requests for the VRShivaji Construction site."
}